tap "caarlos0/tap"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"
brew "coreutils"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "luarocks"
brew "mongosh"
brew "neofetch"
brew "neovim"
brew "pyenv"
brew "python@3.11"
brew "ripgrep"
brew "sq"
brew "starship"
brew "youtube-dl"
brew "caarlos0/tap/timer"
brew "koekeishiya/formulae/yabai"
brew "mongodb/brew/mongodb-community"
cask "edex-ui"
cask "maccy"
cask "temurin"
vscode "aaron-bond.better-comments"
vscode "bajdzis.vscode-database"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.jshint"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "glenn2223.live-sass"
vscode "hediet.debug-visualizer"
vscode "hediet.vscode-drawio"
vscode "iampeterbanjo.elixirlinter"
vscode "jakebecker.elixir-ls"
vscode "mjmcloug.vscode-elixir"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "mtxr.sqltools"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "shyykoserhiy.vscode-spotify"
vscode "syler.sass-indented"
vscode "tht13.python"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wallabyjs.quokka-vscode"
vscode "xabikos.javascriptsnippets"
go "github.com/open-pomodoro/openpomodoro-cli/cmd/pomodoro"
